<?php
  class Человек{
     var  $имя;
     var  $возраст;
      
      public function __construct($мое_имя="Макс",$мой_возраст=24)
      {
          $this->имя=$мое_имя;
          $this->возраст=$мой_возраст;
      }
      public function Обо_мне()
      {
          return "Меня зовут ".$this->имя." мне ".$this->возраст;
      }
      
  }


  class Женщина extends Человек
  {
      var $прическа;
	  var $наряд;
	  
	  public function SetВид($прическа="карэ", $наряд="платье")
	  {
	    $this->прическа=$прическа;
	    $this->наряд=$наряд;
	  }
	  
	  
	  public function GetВид()
	  {
		  return " Моя прическа ".$this->прическа.", а наряд - ".$this->наряд;
	  }
  }

 $max=new Человек("Евгений",40);

 echo $max->Обо_мне().'<br>';

 $w1=new Женщина("Анна",28);
 $w1->SetВид("коса-корона","бикини");
  echo $w1->Обо_мне();
  echo $w1->GetВид();